


# Арифметические и логические операции в Python (стр. 14)
print(1 + 1) # Сложение
print(1 - 1) # Вычитание
print(1 - -1) # Вычитание
print(1 * 2) # Умножение
print(8 / 4) # Деление
print(round(8 / 3, 2)) # Деление с округлением
print(8 // 3) # Целочисленное деление
print(-8 // 3) # Целочисленное деление (ВНИМАНИЕ! Целочисленное деление в Python 3 округляет итоговое значение в меньшую сторону)
print(8 % 3) # Остаток от деления
print(2 ** 3) #Возведение в степень

# Логические операторы в Python (стр. 15)

